import React from 'react';
import { FaRegStar } from "react-icons/fa";

const Strength = () => {
    const lists = [
        "บริษัทมีตัวตน มีการรับรองจากหน่วยงานการท่องเที่ยว และ กรมพัฒนาธุรกิจ กระทรวงพาณิชย์ ไว้วางใจได้ 100%",
        "ติดต่อสื่อสารง่าย",
        "ดำเนินการ จัดทัวร์ ด้วยความรวดเร็ว ทันใจ",
        "มีทีมงานที่เชี่ยวชาญทุกเส้นทาง จัดทัวร์ ทั่วโลก",
        "จัดรายการทัวร์ ได้น่าสนใจ จัดทัวร์ ได้ทุกรูปแบบ ตรงตามความต้องการ ทั้ง ครอบครัว,องค์กร",
        "เราได้รับความไว้วางใจกว่า 20 ปีในบริการ จัดทัวร์ ดูงานต่างประเทศ กว่า 400 กรุ๊ป ทั้งลูกค้าชาวไทย,ชาวต่างชาติ",
        "เราคำนึงถึงผลประโยชน์ในทุกๆด้าน ของลูกค้าเป็นสำคัญ",
        "บริการจัดทัวร์ ลูกค้าทุกท่านด้วยใจ ให้คุณประทับใจตั้งแต่ติดต่อกับทีมงาน ออกเดินทาง จนกระทั่งเดินทางกลับ",
        "จัดแพ็คเกจให้กับคุณในราคาย่อมเยาว์ คุ้มค่าคุ้มราคา จัดสรรราคาให้เหมาะสมกับงบประมาณอย่างแน่นอน",
        "สำหรับองค์กรต่างๆ เราสามารถจัดกิจกรรมดีๆ และพิเศษให้กับลูกค้าทุกท่านที่ต้องการ",
        "สำหรับองค์กรที่ต้องการไปศึกษาดูงาน เราจะมอบสิทธิพิเศษต่างๆ สำหรับเข้าดูงาน Exhibition",
        "กำหนดเวลาเที่ยวได้เอง ปรับโปรแกรมทัวร์ได้ตามใจชอบ",
        "เปิดประสบการณ์ เที่ยว มุมใหม่ เจาะลึกที่เที่ยว โดย มัคคุเทศก์ชำนาญเฉพาะทาง",
        "กิน-เที่ยว แบบ เต็มที่ มีระดับ แต่อยู่ในงบที่คุณต้องการ",
    ];

    const StrengthList = () => {
        return lists.map((item: any, index:number) => ( <div key={index} className="py-2 flex"><FaRegStar className="text-[#ffc107] text-lg w-1/12" /><span className="mx-2 w-11/12">{item}</span></div> ))
    }

  return (
    <div className="rounded-lg border border-gray-300 mx-2 px-3 py-5 my-5">
      <div className="font-bold py-2">
        ข้อดีของการไปเที่ยวแบบ จัดทัวร์ กับ Thaifly.com
      </div>
      <hr className='pb-3' />
      <StrengthList />
    </div>
  )
}

export default Strength
